<details ><summary>apply for staging 2025-03-30 03:20:38 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #8
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role.ecr-access-2 will be created
  + resource "aws_iam_role" "ecr-access-2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecr.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr-access-2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_iam_role.ecr-access-2: Creating...
aws_iam_role.ecr-access-2: Creation complete after 1s [id=ecr-access-2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>

</details>